In [3]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
label= ["a", "b", "c"]
my_list= [34, 12, 5]
arr= np.array(my_list)
d={"a":34, "b":12, "c":5}

In [6]:
pd.Series(data= arr)

0    34
1    12
2     5
dtype: int32

In [7]:
pd.Series(arr)

0    34
1    12
2     5
dtype: int32

In [8]:
pd.Series(index= label, data= arr)

a    34
b    12
c     5
dtype: int32

In [9]:
s1= pd.Series(arr, label)

In [10]:
s2= pd.Series([43, 54,2],["a", "c", "d"])

In [11]:
s3= pd.Series(np.random.randint(low=0, high=10, size=3 ), ['e','f','g'])
s3

e    8
f    4
g    6
dtype: int32

In [12]:
s1

a    34
b    12
c     5
dtype: int32

In [13]:
s2

a    43
c    54
d     2
dtype: int64

In [14]:
s1+s2

a    77.0
b     NaN
c    59.0
d     NaN
dtype: float64

In [15]:
s1['b']

12

In [16]:
#Datafram use pandas

In [17]:
np.random.seed(101)
df= pd.DataFrame(np.random.randn(5, 4), ["A", "B", "C", "D", "E"],["W", "X", "Y", "Z"])

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
type(df)

pandas.core.frame.DataFrame

In [66]:
type([df])

list

In [21]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [22]:
type(df["W"])

pandas.core.series.Series

In [23]:
df[["W", "X"]]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [24]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
#Add a new coloum 
df["G"]= np.random.randn()

In [26]:
df

          W         X         Y         Z         G
A  2.706850  0.628133  0.907969  0.503826  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  0.302665
C -2.018168  0.740122  0.528813 -0.589001  0.302665
D  0.188695 -0.758872 -0.933237  0.955057  0.302665
E  0.190794  1.978757  2.605967  0.683509  0.302665

In [27]:
df.drop("G", axis= 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df

          W         X         Y         Z         G
A  2.706850  0.628133  0.907969  0.503826  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  0.302665
C -2.018168  0.740122  0.528813 -0.589001  0.302665
D  0.188695 -0.758872 -0.933237  0.955057  0.302665
E  0.190794  1.978757  2.605967  0.683509  0.302665

In [29]:
#if we see G coloum are not parmanently deleted, if you want to parmanent delete then
#here axis=1 means coloum if axis=0 then its row
df.drop("G", axis=1, inplace= True)

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
#Row operation

In [32]:
df.drop("Z", axis= 1)

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [33]:
#Use row name
df.loc["A"]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [34]:
#use row index number
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df.loc["A", "X"]

0.6281327087844596

In [37]:
df.loc[["B", "C"], ["X", "Y"]]

          X         Y
B -0.319318 -0.848077
C  0.740122  0.528813

In [38]:
df.loc[["A","B", "C"],["W", "X"]]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122

In [39]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df["W"]>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [42]:
#show only true row base on given condition
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
#w coloum er o theke choto row er x y coloum print koro
df[df["W"]<0] [["X", "Y"]]

          X         Y
C  0.740122  0.528813

In [44]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df[df["W"]>0]  [["X", "Y"]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [46]:
df[(df["X"]<0) & (df["Z"]<.90)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965

In [47]:
df[df["X"]<0]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [48]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [49]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df["ind"]= np.random.randn()
df

          W         X         Y         Z       ind
A  2.706850  0.628133  0.907969  0.503826  1.693723
B  0.651118 -0.319318 -0.848077  0.605965  1.693723
C -2.018168  0.740122  0.528813 -0.589001  1.693723
D  0.188695 -0.758872 -0.933237  0.955057  1.693723
E  0.190794  1.978757  2.605967  0.683509  1.693723

In [51]:
df.set_index("ind")

                 W         X         Y         Z
ind
1.693723  2.706850  0.628133  0.907969  0.503826
1.693723  0.651118 -0.319318 -0.848077  0.605965
1.693723 -2.018168  0.740122  0.528813 -0.589001
1.693723  0.188695 -0.758872 -0.933237  0.955057
1.693723  0.190794  1.978757  2.605967  0.683509

In [52]:
df

          W         X         Y         Z       ind
A  2.706850  0.628133  0.907969  0.503826  1.693723
B  0.651118 -0.319318 -0.848077  0.605965  1.693723
C -2.018168  0.740122  0.528813 -0.589001  1.693723
D  0.188695 -0.758872 -0.933237  0.955057  1.693723
E  0.190794  1.978757  2.605967  0.683509  1.693723

In [53]:
df.drop("ind", axis=1, inplace= True)

In [54]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
#multiindex

In [56]:
#index levels
outside= ["G1", "G1", "G1", "G2", "G2", "G2"]
inside= [1, 2, 3, 1, 2, 3]
hier_indx= list(zip(outside, inside))
hier_indx= pd.MultiIndex.from_tuples(hier_indx)

In [57]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [67]:
hier_indx

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           names=['group', 'number'])

In [58]:
pd.MultiIndex.from_tuples(hier_indx)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [59]:
df= pd.DataFrame(np.random.randn(6, 2), hier_indx, ["a", "b"])

In [60]:
df

             a         b
G1 1 -1.706086 -1.159119
   2 -0.134841  0.390528
   3  0.166905  0.184502
G2 1  0.807706  0.072960
   2  0.638787  0.329646
   3 -0.497104 -0.754070

In [61]:
df.loc["G1"].loc[1]

a   -1.706086
b   -1.159119
Name: 1, dtype: float64

In [62]:
df.index.names= ["group", "number"]

In [63]:
df

                     a         b
group number
G1    1      -1.706086 -1.159119
      2      -0.134841  0.390528
      3       0.166905  0.184502
G2    1       0.807706  0.072960
      2       0.638787  0.329646
      3      -0.497104 -0.754070

In [64]:
#when we select particular value then
df.loc["G1"].loc[3]["b"]

0.18450185928224264

In [65]:
#when we want to get one more group value it can be possible using loc function
#but if we use (xs) function it is very easy
df.xs(1, level= "number")

              a         b
group
G1    -1.706086 -1.159119
G2     0.807706  0.072960